espressif/esp-idf/components/soc/esp32p4/register/hw_ver2/soc/dma2d_eco5_struct.h
/** Type of out_scramble_chn register
 *  Configures the tx scramble of channel n
 */
typedef union {
    struct {
        /** out_scramble_sel_pre_chn : R/W; bitpos: [2:0]; default: 0;
         *  Scramble data before color convert :  0 : BYTE2-1-0   1 : BYTE2-0-1    2 :
         *  BYTE1-0-2    3 : BYTE1-2-0    4 : BYTE0-2-1    5 : BYTE0-1-2
         */
        uint32_t out_scramble_sel_pre_chn:3;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} dma2d_out_scramble_chn_reg_t;

/** Type of out_color_param0_chn register
 *  Configures the tx color convert parameter of channel n
 */
typedef union {
    struct {
        /** out_color_param_h0_chn : R/W; bitpos: [20:0]; default: 298;
         *  Set first 2 parameter of most significant byte of pending 3 bytes
         */
        uint32_t out_color_param_h0_chn:21;
        uint32_t reserved_21:11;
    };
    uint32_t val;
} dma2d_out_color_param0_chn_reg_t;

/** Type of out_color_param1_chn register
 *  Configures the tx color convert parameter of channel n
 */
typedef union {
    struct {
        /** out_color_param_h1_chn : R/W; bitpos: [27:0]; default: 210164121;
         *  Set last 2 parameter of most significant byte of pending 3 bytes
         */
        uint32_t out_color_param_h1_chn:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} dma2d_out_color_param1_chn_reg_t;

/** Type of out_color_param2_chn register
 *  Configures the tx color convert parameter of channel n
 */
typedef union {
    struct {
        /** out_color_param_m0_chn : R/W; bitpos: [20:0]; default: 1995050;
         *  Set first 2 parameter of midium significant byte of pending 3 bytes
         */
        uint32_t out_color_param_m0_chn:21;
        uint32_t reserved_21:11;
    };
    uint32_t val;
} dma2d_out_color_param2_chn_reg_t;

/** Type of out_color_param3_chn register
 *  Configures the tx color convert parameter of channel n
 */
typedef union {
    struct {
        /** out_color_param_m1_chn : R/W; bitpos: [27:0]; default: 35540784;
         *  Set last 2 parameter of midium significant byte of pending 3 bytes
         */
        uint32_t out_color_param_m1_chn:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} dma2d_out_color_param3_chn_reg_t;

/** Type of out_color_param4_chn register
 *  Configures the tx color convert parameter of channel n
 */
typedef union {
    struct {
        /** out_color_param_l0_chn : R/W; bitpos: [20:0]; default: 528682;
         *  Set first 2 parameter of least significant byte of pending 3 bytes
         */
        uint32_t out_color_param_l0_chn:21;
        uint32_t reserved_21:11;
    };
    uint32_t val;
} dma2d_out_color_param4_chn_reg_t;

/** Type of out_color_param5_chn register
 *  Configures the tx color convert parameter of channel n
 */
typedef union {
    struct {
        /** out_color_param_l1_chn : R/W; bitpos: [27:0]; default: 195899392;
         *  Set last 2 parameter of least significant byte of pending 3 bytes
         */
        uint32_t out_color_param_l1_chn:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} dma2d_out_color_param5_chn_reg_t;

/** Type of out_etm_conf_chn register
 *  Configures the tx etm of channel n
 */
typedef union {
    struct {
        /** out_etm_en_chn : R/W; bitpos: [0]; default: 0;
         *  Configures the enable of the etm function, 1 is enable.
         */
        uint32_t out_etm_en_chn:1;
        /** out_etm_loop_en_chn : R/W; bitpos: [1]; default: 0;
         *  Configures the enable of the descriptors loop etm function, 1 is enable.
         */
        uint32_t out_etm_loop_en_chn:1;
        /** out_dscr_task_mak_chn : R/W; bitpos: [3:2]; default: 1;
         *  Configures the maximum number of cacheable descriptors.
         */
        uint32_t out_dscr_task_mak_chn:2;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} dma2d_out_etm_conf_chn_reg_t;

/** Type of out_dscr_port_blk_chn register
 *  Configures the tx block size in dscr port mode
 */
typedef union {
    struct {
        /** out_dscr_port_blk_h_chn : R/W; bitpos: [13:0]; default: 18;
         *  Set the vertical height of tx block size in dscr port mode
         */
        uint32_t out_dscr_port_blk_h_chn:14;
        /** out_dscr_port_blk_v_chn : R/W; bitpos: [27:14]; default: 18;
         *  Set the horizontal width of tx block size in dscr port mode
         */
        uint32_t out_dscr_port_blk_v_chn:14;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} dma2d_out_dscr_port_blk_chn_reg_t;

/** Type of in_conf0_chn register
 *  Configures the rx direction of channel n
 */
typedef union {
    struct {
        /** in_mem_trans_en_chn : R/W; bitpos: [0]; default: 0;
         *  enable memory trans of the same channel
         */
        uint32_t in_mem_trans_en_chn:1;
        uint32_t reserved_1:1;
        /** indscr_burst_en_chn : R/W; bitpos: [2]; default: 0;
         *  Set this bit to 1 to enable INCR burst transfer for Rx transmitting link descriptor
         *  when accessing SRAM.
         */
        uint32_t indscr_burst_en_chn:1;
        /** in_ecc_aes_en_chn : R/W; bitpos: [3]; default: 0;
         *  When access address space is ecc/aes area, this bit should be set to 1. In this
         *  case, the start address of square should be 16-bit aligned. The width of square
         *  multiply byte number of one pixel should be 16-bit aligned.
         */
        uint32_t in_ecc_aes_en_chn:1;
        /** in_check_owner_chn : R/W; bitpos: [4]; default: 0;
         *  Set this bit to enable checking the owner attribute of the link descriptor.
         */
        uint32_t in_check_owner_chn:1;
        /** in_loop_test_chn : R/W; bitpos: [5]; default: 0;
         *  reserved
         */
        uint32_t in_loop_test_chn:1;
        /** in_mem_burst_length_chn : R/W; bitpos: [8:6]; default: 0;
         *  Block size of Rx channel 0. 0: single      1: 16 bytes      2: 32 bytes    3: 64
         *  bytes    4: 128 bytes
         */
        uint32_t in_mem_burst_length_chn:3;
        /** in_macro_block_size_chn : R/W; bitpos: [10:9]; default: 0;
         *  Sel RX macro-block size 0: 8pixel*8pixel     1: 8pixel*16pixel     2:
         *  16pixel*16pixel     3: no macro-block     , only useful in mode 1 of the link
         *  descriptor
         */
        uint32_t in_macro_block_size_chn:2;
        /** in_dscr_port_en_chn : R/W; bitpos: [11]; default: 0;
         *  Set this bit to 1 to obtain descriptor from IP port
         */
        uint32_t in_dscr_port_en_chn:1;
        /** in_page_bound_en_chn : R/W; bitpos: [12]; default: 0;
         *  Set this bit to 1 to make sure AXI write data don't cross the address boundary
         *  which define by mem_burst_length
         */
        uint32_t in_page_bound_en_chn:1;
        uint32_t reserved_13:3;
        /** in_reorder_en_chn : R/W; bitpos: [16]; default: 0;
         *  Enable RX channel 0 macro block reorder when set to 1, only channel0 have this
         *  selection
         */
        uint32_t in_reorder_en_chn:1;
        uint32_t reserved_17:7;
        /** in_rst_chn : R/W; bitpos: [24]; default: 0;
         *  Write 1 then write 0 to this bit to reset Rx channel
         */
        uint32_t in_rst_chn:1;
        /** in_cmd_disable_chn : R/W; bitpos: [25]; default: 0;
         *  Write 1 before reset and write 0 after reset
         */
        uint32_t in_cmd_disable_chn:1;
        /** in_arb_weight_opt_dis_chn : R/W; bitpos: [26]; default: 0;
         *  Set this bit to 1 to disable arbiter optimum weight function.
         */
        uint32_t in_arb_weight_opt_dis_chn:1;
        uint32_t reserved_27:5;
    };
    uint32_t val;
} dma2d_in_conf0_chn_reg_t;

